[
    {
        "chef_id": "ch001",
        "name": "Sanjeev Kapoor",
        "experience": " 4 years Experience",
        "recipes": [
            "Miso Chicken",
            "Salami sandwich",
            "Tomato Chicken"
        ],
        "likes": "5.4k",
        "short-bio": "Sanjeev Kapoor is a renowned Indian chef who has been in the culinary industry for over four decades. He is known for his simple and easy-to-follow recipes that cater to all levels of cooking expertise. Kapoor has authored several cookbooks and has also hosted numerous television shows on cooking. He is the recipient of several awards and has also been conferred the Padma Shri award by the Government of India.",
        "image": "https://i.ibb.co/0Zfbn9g/HOW-CHEF-SANJEEV-KAPOOR-SAVED-INDIAN-MARRIAGES-1.jpg",
        "recipes_details": [
            {
                "recipe_id": "ch001_r001",
                "recipe_name": "Miso Chicken",
                "rating": 4,
                "ingredients": [
                    "4 boneless, skinless chicken breasts",
                    "1/4 cup white miso paste",
                    "1/4 cup honey",
                    "2 tbsp soy sauce",
                    "2 tbsp rice vinegar"
                ],
                "cooking_method": "Preheat the oven to 400°F (200°C).In a small bowl, whisk togethethemiso paste, honey, soy sauce, rice vinegar, minced garlic, and grated ginger.Arrange the chicken breasts in a baking dish and pour the miso sauce over them, making sure they are fully coated.Bake the chicken for 25-30 minutes, until the internal temperature reaches 165°F (74°C) and the chicken is fully cooked.Remove the chicken from the oven and let it rest for 5 minutes Garnish with thinly sliced green onions and sesame seeds, and serve."
            },
            {
                "recipe_id": "ch001_r002",
                "recipe_name": "Salami sandwich",
                "rating": 3,
                "ingredients": [
                    "4 slices of bread",
                    "4-6 slices of salami",
                    "2-3 slices of cheese",
                    "Lettuce leaves",
                    "Tomato slices"
                ],
                "cooking_method": "Toast the bread slices in a toaster or on a pan until they are lightly browned and crispy.Spread a layer of mayonnaise on each slice of toasted bread.Add a few lettuce leaves and tomato slices on one slice of bread.Place the salami slices and cheese on top of the tomato slices.Close the sandwich with the other slice of bread.Cut the sandwich diagonally into two halves.Serve the salami sandwich with some chips or fries on the side."
            },
            {
                "recipe_id": "ch001_r003",
                "recipe_name": "Tomato Chicken",
                "rating": 4,
                "ingredients": [
                    "1 lb boneless, skinless chicken breasts, cut into bite-sized pieces",
                    "2 tbsp olive oil",
                    "1/2 tsp ground cumin",
                    "1/2 tsp ground coriander",
                    "Fresh parsley or cilantro, chopped, for garnish"
                ],
                "cooking_method": "Heat the olive oil in a large skillet over medium-high heat.Add the onion and garlic and cook for 2-3 minutes until the onion is translucent and the garlic is fragrant.Add the chicken and cook for 5-6 minutes, stirring occasionally, until the chicken is browned on all sides. Add the red and green bell peppers, diced tomatoes, cumin, and coriander to the skillet.Season with salt and black pepper to taste.tir everything together and bring to a simmer.Reduce the heat to medium-low and let the mixture cook for 15-20 minutes, or until the chicken is cooked through and the vegetables are tender.Garnish with fresh parsley or cilantro before serving.."
            }
        ]
    },
    {
        "chef_id": "ch002",
        "name": "Vikas Khanna",
        "experience": "2 years Experience",
        "recipes": [
            "shahi paneer",
            "Chicken Tikka",
            "Mango Yogurt"
        ],
        "likes": "2.5k",
        "short-bio": "Vikas Khanna is an Indian chef with 2 years of experience in cooking delicious dishes. He is known for his expertise in preparing popular Indian recipes such as shahi paneer, Chicken Tikka, and Mango Yogurt. With his unique cooking style and presentation, he has gained a lot of popularity among food lovers and has received 2.5k likes for his recipes. Vikas's dedication and passion for cooking have made him one of the most sought-after chefs in the industry.",
        "image": "https://i.ibb.co/CPycb94/E-kx-ya-WQAALm-XT-1.jpg",
        "recipes_details": [
            {
                "recipe_id": "ch002_r001",
                "recipe_name": "shahi paneer",
                "rating": 5,
                "ingredients": [
                    "1 cup paneer, cut into cubes",
                    "2 tbsp ghee or oil",
                    "1 onion, chopped",
                    "1/4 tsp garam masala",
                    "Fresh coriander leaves, chopped for garnish"
                ],
                "cooking_method": "Heat the ghee or oil in a pan over medium heat.Add the chopped onions and sauté until golden brown.Add the chopped tomatoes and cook until they are soft and mushy.Add ginger paste and garlic paste and cook for 1-2 minutes.Add cumin powder, coriander powder, turmeric powder, and red chili powder and cook for another minute.Add the soaked cashews and milk and cook until the mixture thickens and the cashews are soft.Turn off the heat and let the mixture cool for a few minutes.Use a blender to blend the mixture into a smooth paste.Pour the paste back into the pan and bring it to a simmer.Add the paneer cubes and salt, and let it cook for 2-3 minutes.Add garam masala and fresh coriander leaves for garnish, and serve hot with naan or rice."
            },
            {
                "recipe_id": "ch002_r002",
                "recipe_name": "Chicken Tikka",
                "rating": 5,
                "ingredients": [
                    "1 lb boneless, skinless chicken breasts, cut into bite-sized pieces",
                    "2 tbsp lemon juice",
                    "1 tbsp grated ginger",
                    "1/2 tsp ground cinnamon",
                    "Salt and black pepper, to taste"
                ],
                "cooking_method": "In a mixing bowl, whisk together the yogurt, lemon juice, grated ginger, minced garlic, ground cumin, paprika, ground cinnamon, salt, and black pepper.Add the chicken pieces to the bowl and toss them in the marinade until fully coated. Cover the bowl with plastic wrap and refrigerate for at least 1 hour or up to overnight.Preheat the oven to 400°F (200°C) and line a baking sheet with parchment paper.Thread the chicken pieces onto skewers, leaving a little space between each piece, and place them on the prepared baking sheet.Bake the chicken in the preheated oven for 20-25 minutes, or until cooked through and slightly charred around the edges.Serve hot with your favorite dipping sauce or chutney."
            },
            {
                "recipe_id": "ch002_r003",
                "recipe_name": "mango yogurt",
                "rating": 3,
                "ingredients": [
                    "2 ripe mangoes, peeled and cubed",
                    "2 cups plain Greek yogurt",
                    "2 tbsp honey",
                    "1/2 tsp ground cardamom",
                    "1/4 cup chopped nuts (such as almonds or pistachios), for garnish"
                ],
                "cooking_method": "In a blender or food processor, puree the mangoes until smooth.In a medium bowl, whisk together the mango puree, Greek yogurt, honey, and cardamom until well combined.Divide the mango yogurt among serving bowls.Sprinkle chopped nuts over the top of each bowl for garnish.Serve chilled."
            }
        ]
    },
    {
        "chef_id": "ch003",
        "name": "Ranveer Brar",
        "experience": "6 years Experience",
        "recipes": [
            "Mutton Kofta",
            "Raj Kachari",
            "Malpua"
        ],
        "likes": "2.8k",
        "short-bio": "Ranveer Brar is an experienced chef with 6 years of culinary expertise. He is known for his delicious recipes such as Mutton Kofta, Raj Kachari, and Malpua. With his unique cooking style and presentation, he has gained a lot of popularity among food lovers and has received 2.8k likes for his recipes. Ranveer's passion for cooking and his ability to innovate and experiment with flavors have made him a renowned chef in the industry.",
        "image": "https://i.ibb.co/2FJ4P7h/img-114119-ranveerbrar-s-1.jpg",
        "recipes_details": [
            {
                "recipe_id": "ch003_r001",
                "recipe_name": "Mutton Kofta",
                "rating": 2,
                "ingredients": [
                    "1 lb ground mutton",
                    "1/2 cup finely chopped onion",
                    "1/4 cup finely chopped cilantro leaves",
                    "Salt, to taste",
                    "Oil, for frying"
                ],
                "cooking_method": "In a mixing bowl, combine ground mutton, chopped onion, cilantro leaves, mint leaves, green chillies, ginger paste, garlic paste, garam masala, cumin powder, coriander powder, and salt. Mix well to combine.Divide the mixture into small equal portions and shape them into round balls or oval-shaped koftas.Heat oil in a deep frying pan or kadhai over medium heat. Once the oil is hot, gently slide the koftas into the oil and fry until they turn golden brown on all sides.Remove the koftas from the oil using a slotted spoon and place them on a plate lined with paper towels to absorb any excess oil.Serve hot with your favorite dipping sauce or chutney."
            },
            {
                "recipe_id": "ch003_r002",
                "recipe_name": "Raj Kachari",
                "rating": 4,
                "ingredients": [
                    "2 cups basmati rice, soaked for 30 minutes",
                    "1 lb boneless mutton, cut into small pieces",
                    "1 cup plain yogurt",
                    "2 onions, sliced",
                    "2 tbsp ginger-garlic paste"
                ],
                "cooking_method": "Heat a large pot or dutch oven over medium-high heat and add the ghee.Add the sliced onions and fry until golden brown. Remove half of the onions and set aside for garnish.Add the cumin seeds, coriander seeds, cloves, cardamom pods, cinnamon stick, and bay leaf to the remaining onions in the pot and fry for a minute or until fragrant.Add the ginger-garlic paste and green chilies and fry for another minute.Add the mutton and fry for a few minutes or until the meat is browned on all sides.Add the yogurt, red chili powder, and salt to the pot and mix well. Cook for a few minutes until the yogurt has been absorbed and the meat is coated in the spice mixture.Spread the meat evenly in the bottom of the pot and then layer the soaked rice on top. Pour the milk over the rice and then sprinkle the saffron strands on top.Cover the pot with a tight-fitting lid and cook over low heat for 30-40 minutes, or until the rice is cooked and the meat is tender.Remove from heat and let it rest for 10 minutes. Fluff the rice with a fork and then garnish with the fried onions and fresh cilantro leaves."
            },
            {
                "recipe_id": "ch003_r003",
                "recipe_name": "Malpua",
                "rating": 3,
                "ingredients": [
                    "1 cup all-purpose flour",
                    "1/4 cup semolina",
                    "1/4 cup milk powder",
                    "1/4 tsp baking powder",
                    "1/2 tsp fennel seeds"
                ],
                "cooking_method": "In a bowl, mix together all-purpose flour, semolina, milk powder, baking powder, fennel seeds, and green cardamom powGradually add milk and water to the dry ingredients to make a smooth batter. The batter should be thick and without any lumps.Heat oil in a pan for frying. When the oil is hot, reduce the heat to low.Pour 1 tablespoon of the batter in the oil to make a small pancake. Repeat with more batter, but do not overcrowd the pan.Fry the malpuas on low heat until they are golden brown on both sides. Remove them from the pan with a slotted spoon and place them on a paper towel to absorb any excess oil.To make the syrup, mix together sugar, water, green cardamom powder, and saffron strands in a saucepan. Heat the mixture on medium heat and stir until the sugar dissolves.Reduce the heat and let the syrup simmer for 5-7 minutes until it thickens. Turn off the"
            }
        ]
    },
    {
        "chef_id": "ch004",
        "name": "Tarla Dalal",
        "experience": "3 years Experience",
        "recipes": [
            "Shishi Tawook",
            "Kibbeh Nayyeh",
            "Tabbouleh Salad"
        ],
        "likes": "7.65k",
        "short-bio": "Tarla Dalal was an experienced chef with 3 years of culinary expertise. She was known for her delicious recipes such as Shishi Tawook, Kibbeh Nayyeh, and Tabbouleh Salad. With her unique cooking style and presentation, she had gained a lot of popularity among food lovers and had received 7.65k likes for her recipes. Tarla's passion for cooking and her ability to create mouth-watering recipes had made her a renowned chef in the industry.",
        "image": "https://i.ibb.co/d6XTrTC/download-1.jpg",
        "recipes_details": [
            {
                "recipe_id": "ch004_r001",
                "recipe_name": "Shishi Tawook",
                "rating": 2,
                "ingredients": [
                    "1 lb ground mutton",
                    "1/2 cup finely chopped onion",
                    "1/4 cup finely chopped cilantro leaves",
                    "Salt, to taste",
                    "Oil, for frying"
                ],
                "cooking_method": "In a mixing bowl, combine ground mutton, chopped onion, cilantro leaves, mint leaves, green chillies, ginger paste, garlic paste, garam masala, cumin powder, coriander powder, and salt. Mix well to combine.Divide the mixture into small equal portions and shape them into round balls or oval-shaped koftas.Heat oil in a deep frying pan or kadhai over medium heat. Once the oil is hot, gently slide the koftas into the oil and fry until they turn golden brown on all sides.Remove the koftas from the oil using a slotted spoon and place them on a plate lined with paper towels to absorb any excess oil.Serve hot with your favorite dipping sauce or chutney."
            },
            {
                "recipe_id": "ch004_r002",
                "recipe_name": "Kibbeh Nayyeh",
                "rating": 3,
                "ingredients": [
                    "1 lb boneless",
                    "skinless chicken breasts",
                    "cut into bite-sized pieces",
                    "1/2 cup plain yogurt",
                    "1 tbsp tomato paste"
                ],
                "cooking_method": "In a large bowl, whisk together the yogurt, lemon juice, olive oil, tomato paste, garlic, paprika, cumin, salt, and black pepper.Add the chicken pieces to the bowl and stir to coat with the marinade. Cover and refrigerate for at least 2 hours, or overnight.When ready to cook, preheat a grill or grill pan to medium-high heat.Thread the chicken pieces onto skewers, leaving a little space between each piece.Brush the grill or grill pan with vegetable oil.Place the skewers on the grill and cook for 5-7 minutes on each side, or until the chicken is cooked through and lightly charred.Serve hot with rice, salad, and pita bread. Enjoy!"
            },
            {
                "recipe_id": "ch004_r003",
                "recipe_name": "Tabbouleh Salad",
                "rating": 3,
                "ingredients": [
                    "1 cup all-purpose flour",
                    "1/4 cup semolina",
                    "1/4 cup milk powder",
                    "1/4 tsp baking powder",
                    "1/2 tsp fennel seeds"
                ],
                "cooking_method": "In a bowl, mix together all-purpose flour, semolina, milk powder, baking powder, fennel seeds, and green cardamom powGradually add milk and water to the dry ingredients to make a smooth batter. The batter should be thick and without any lumps.Heat oil in a pan for frying. When the oil is hot, reduce the heat to low.Pour 1 tablespoon of the batter in the oil to make a small pancake. Repeat with more batter, but do not overcrowd the pan.Fry the malpuas on low heat until they are golden brown on both sides. Remove them from the pan with a slotted spoon and place them on a paper towel to absorb any excess oil.To make the syrup, mix together sugar, water, green cardamom powder, and saffron strands in a saucepan. Heat the mixture on medium heat and stir until the sugar dissolves.Reduce the heat and let the syrup simmer for 5-7 minutes until it thickens. Turn off the"
            }
        ]
    },
    {
        "chef_id": "ch005",
        "name": "Madhur Jaffrey",
        "experience": "4 years Experience",
        "recipes": [
            "Salami sandwich",
            "Tomato Chicken",
            "Mango Yogurt"
        ],
        "likes": "9.5k",
        "short-bio": "Madhur Jaffrey is an experienced chef with 4 years of culinary expertise. She is known for her delicious recipes such as Salami sandwich, Tomato Chicken, and Mango Yogurt. With her unique cooking style and presentation, she has gained a lot of popularity among food lovers and has received 9.5k likes for her recipes. Madhur's passion for cooking and her ability to create flavorful and healthy dishes have made her a renowned chef in the industry.",
        "image": "https://i.ibb.co/XzjS9RT/x360-1.jpg",
        "recipes_details": [
            {
                "recipe_id": "ch001_r001",
                "recipe_name": "Miso Chicken",
                "rating": 4,
                "ingredients": [
                    "4 boneless, skinless chicken breasts",
                    "1/4 cup white miso paste",
                    "1/4 cup honey",
                    "2 tbsp soy sauce",
                    "2 tbsp rice vinegar"
                ],
                "cooking_method": "Preheat the oven to 400°F (200°C).In a small bowl, whisk togethethemiso paste, honey, soy sauce, rice vinegar, minced garlic, and grated ginger.Arrange the chicken breasts in a baking dish and pour the miso sauce over them, making sure they are fully coated.Bake the chicken for 25-30 minutes, until the internal temperature reaches 165°F (74°C) and the chicken is fully cooked.Remove the chicken from the oven and let it rest for 5 minutes Garnish with thinly sliced green onions and sesame seeds, and serve."
            },
            {
                "recipe_id": "ch001_r002",
                "recipe_name": "Salami sandwich",
                "rating": 3,
                "ingredients": [
                    "4 slices of bread",
                    "4-6 slices of salami",
                    "2-3 slices of cheese",
                    "Lettuce leaves",
                    "Tomato slices"
                ],
                "cooking_method": "Toast the bread slices in a toaster or on a pan until they are lightly browned and crispy.Spread a layer of mayonnaise on each slice of toasted bread.Add a few lettuce leaves and tomato slices on one slice of bread.Place the salami slices and cheese on top of the tomato slices.Close the sandwich with the other slice of bread.Cut the sandwich diagonally into two halves.Serve the salami sandwich with some chips or fries on the side."
            },
            {
                "recipe_id": "ch001_r003",
                "recipe_name": "Tomato Chicken",
                "rating": 4,
                "ingredients": [
                    "1 lb boneless, skinless chicken breasts, cut into bite-sized pieces",
                    "2 tbsp olive oil",
                    "1/2 tsp ground cumin",
                    "1/2 tsp ground coriander",
                    "Fresh parsley or cilantro, chopped, for garnish"
                ],
                "cooking_method": "Heat the olive oil in a large skillet over medium-high heat.Add the onion and garlic and cook for 2-3 minutes until the onion is translucent and the garlic is fragrant.Add the chicken and cook for 5-6 minutes, stirring occasionally, until the chicken is browned on all sides. Add the red and green bell peppers, diced tomatoes, cumin, and coriander to the skillet.Season with salt and black pepper to taste.tir everything together and bring to a simmer.Reduce the heat to medium-low and let the mixture cook for 15-20 minutes, or until the chicken is cooked through and the vegetables are tender.Garnish with fresh parsley or cilantro before serving.."
            }
        ]
    },
    {
        "chef_id": "ch006",
        "name": "Hari Nayak",
        "experience": "2 years Experience",
        "recipes": [
            "Chicken Tikka",
            "Mango Yogurt",
            "Masala"
        ],
        "likes": "12.4k",
        "short-bio": "Hari Nayak is a talented chef with 2 years of experience in the culinary industry. He is known for his mouth-watering recipes such as Chicken Tikka, Mango Yogurt, and Masala. His unique cooking techniques and use of spices have made him a favorite among food lovers, and he has received 12.4k likes for his recipes. Hari's passion for cooking and his ability to create delicious dishes have made him a renowned chef in the industry.",
        "image": "https://i.ibb.co/z8CSXKg/Hari-Nayak-1.jpg",
        "recipes_details": [
            {
                "recipe_id": "ch002_r001",
                "recipe_name": "shahi paneer",
                "rating": 5,
                "ingredients": [
                    "1 cup paneer, cut into cubes",
                    "2 tbsp ghee or oil",
                    "1 onion, chopped",
                    "1/4 tsp garam masala",
                    "Fresh coriander leaves, chopped for garnish"
                ],
                "cooking_method": "Heat the ghee or oil in a pan over medium heat.Add the chopped onions and sauté until golden brown.Add the chopped tomatoes and cook until they are soft and mushy.Add ginger paste and garlic paste and cook for 1-2 minutes.Add cumin powder, coriander powder, turmeric powder, and red chili powder and cook for another minute.Add the soaked cashews and milk and cook until the mixture thickens and the cashews are soft.Turn off the heat and let the mixture cool for a few minutes.Use a blender to blend the mixture into a smooth paste.Pour the paste back into the pan and bring it to a simmer.Add the paneer cubes and salt, and let it cook for 2-3 minutes.Add garam masala and fresh coriander leaves for garnish, and serve hot with naan or rice."
            },
            {
                "recipe_id": "ch002_r002",
                "recipe_name": "Chicken Tikka",
                "rating": 5,
                "ingredients": [
                    "1 lb boneless, skinless chicken breasts, cut into bite-sized pieces",
                    "2 tbsp lemon juice",
                    "1 tbsp grated ginger",
                    "1/2 tsp ground cinnamon",
                    "Salt and black pepper, to taste"
                ],
                "cooking_method": "In a mixing bowl, whisk together the yogurt, lemon juice, grated ginger, minced garlic, ground cumin, paprika, ground cinnamon, salt, and black pepper.Add the chicken pieces to the bowl and toss them in the marinade until fully coated. Cover the bowl with plastic wrap and refrigerate for at least 1 hour or up to overnight.Preheat the oven to 400°F (200°C) and line a baking sheet with parchment paper.Thread the chicken pieces onto skewers, leaving a little space between each piece, and place them on the prepared baking sheet.Bake the chicken in the preheated oven for 20-25 minutes, or until cooked through and slightly charred around the edges.Serve hot with your favorite dipping sauce or chutney."
            },
            {
                "recipe_id": "ch002_r003",
                "recipe_name": "mango yogurt",
                "rating": 3,
                "ingredients": [
                    "2 ripe mangoes, peeled and cubed",
                    "2 cups plain Greek yogurt",
                    "2 tbsp honey",
                    "1/2 tsp ground cardamom",
                    "1/4 cup chopped nuts (such as almonds or pistachios), for garnish"
                ],
                "cooking_method": "In a blender or food processor, puree the mangoes until smooth.In a medium bowl, whisk together the mango puree, Greek yogurt, honey, and cardamom until well combined.Divide the mango yogurt among serving bowls.Sprinkle chopped nuts over the top of each bowl for garnish.Serve chilled."
            }
        ]
    }
]